#include <iostream>
using namespace std;
// Да се напише програма, която изведа върху екрана всяка от следните две фигури от цифри
// и след това извежда двете фигури заедно
// Решена в часът с помощ от госпожата.. :)
int main()
{
    int i,j,n;
 cin >> n;
    for(i = 0; i<n; i++) // Определя редовете
    {
        // Определя...............
           for(int k=0;k<=i;k++)
          {
            cout << " ";
          }
          // Определя спейсо-вете и прави в обратен ред

        for(j = 1; j<=n-i;j++)
        {
            cout << j;
        }
    cout << endl;
    }

    return 0;
}
